{
    "nav": {
        "lithuanian": "Lietuvių",
        "english": "Anglų",
        "home": "Pagrindinis",
        "about": "Apie mane",
        "experience": "Patirtis",
        "projects": "Projektai",
        "contact": "Kontaktai",
        "hobby_projects": "Pomėgių projektai"
    },
    "name": {
        "description": "„Full-stack“ programuotojas. Trečio kurso informatikos studentas."
    },
    "about": {
        "title": "Apie mane",
        "description": {
            "first": "aš esu „full-stack“ programuotojas, siekiantis tobulinti savo įgūdžius ir kurti intuityvias, gražias ir svarbiausia - saugias aplikacijas. Šiuo metu esu trečio kurso informatikos studentas Klaipėdos valstybinėje kolegijoje.",
            "second": "Studijų metais daug išmokau atlikdamas įvairius projektus. Nebijojau imtis visiškai naujų dalykų tiek vienas, tiek su kolegomis ir kūriau projektus naudodamas Node.js, Express.js, Nuxt 3, Android Studio, Docker ir kitus įrankius.",
            "third": "Dirbau „Agile“ aplinkoje ir žinau jos pagrindus bei komunikacijos, komandinio darbo ir iniciatyvos svarbą sėkmingui rezultatui pasiekti.",
            "fourth": "Laisvalaikiu mėgstu žaisti vaizdo žaidimus, žvejoti, žiūrėti vaizdo įrašus „YouTube“ ir kartais mokytis naujų dalykų, tokių kaip vaizdo redagavimo, Blender, Unreal Engine arba žaidimų modifikavimo." 
        }
    },
    "skills": {
        "title": "Įgūdžiai"
    },
    "projects": {
        "title": "Projektai",
        "jobPortal": {
            "title": "Darbo skelbimų portalas",
            "description": "Darbo skelbimų portalas, kuriame galite rasti ar įkelti darbo skelbimus. Kartu su dviem kolegomis išbandėme MERN architektūra. Aš daugiausia dirbau back-end dalyje, kurdamas autentikaciją ir kitas funkcijas naudodamas Passport.js. Mokslinis straipsnis apie šį projektą buvo pristatytas KVK technologijų konferencijoje."
        },
        "smartHome": {
            "title": "Išmaniųjų namų sprendimai",
            "description": "Mobilioji „Android“ programėlė, padedanti nuspręsti, kuri išmaniųjų namų sistema tinkama klientui. Sukurta keturių studentų komandoje. Buvau atsakingas už Scrum vadovo vaidmenį ir tuo pačiu dirbau su front-end kūrimu „Agile“ darbo aplinkoje.",
            "detailedDescription": "Programėlė duoda vartotojui klausimus ir remdamasi atsakymais, siūlo išmaniųjų namų sistemą, kuri būtų tinkama klientui. Ji taip pat pateikia informaciją apie sistemas ir nuorodas į oficialias sistemų tiekėjų svetaines."
        },
        "recipeApp": {
            "title": "Receptų programėlė",
            "description": "Norėjau daugiau išmokti apie mobiliųjų programėlių kūrimą, todėl sukūriau „Android“ programėlę receptų paieškai ir dalinimuisi. Kūriau vienas kursiniam darbui. Vartotojai gali peržiūrėti, ieškoti, filtruoti, vertinti receptus ir dalintis savo receptais.",
            "detailedDescription": "Tik užsiregistrave vartotojai gali vertinti ir dalintis receptais, naudojamas JWT autentikacijai. Programėlėje taip pat yra funkcija pridėti receptus prie mėgstamiausių ir juos vėliau galima peržiūrėti."
        },
        "scrolle": {
            "title": "Mokymosi sistema „Scrolle“",
            "description": "LMS – mokymosi valdymo sistema, sukurta nuo nulio trijų studentų praktikai užsienyje. Buvau atsakingas už back-end dalį, kūriau ir projektavau mikroservisus, kad užtikrinčiau jog projektas būtų lengvai plečiamas ateityje. Kartais padėdavau su front-end kūrimu.",
            "detailedDescription": "Idėja buvo panaši į Moodle, tačiau mes daug dėmesio kad sukurtume intuityvią, lengvai naudojamą, greitą ir saugią LMS. Tai buvo didelis iššūkis man ir mano kolegoms, tačiau per tris mėnesius pristatėme minimalų prototipą ir daug išmokome. Back-end dalis naudoja Docker, kad sukonfiguruoti mikroservisus į konteinerius, ir Traefik, kad būtų lengviau valdyti maršrutizavimą. Autentikacija buvo saugiai sukurta naudojant „access“ ir „refresh“ JWT, taip pat vartotojai kurie nori laikyti nemokamus kursus gali prisijungti su facebook arba google paskyromis. Mikroservisai buvo diegiami Google Cloud Run platformoje."
        }
    },
    "experience": {
        "title": "Patirtis",
        "college": {
            "title": "Informatikos studentas",
            "location": "Klaipėdos valstybinė kolegija",
            "description": "Studijų metu dirbau su įvairiais projektais, tokiais kaip svetainės, mobiliosios aplikacijos, žaidimai ir papildytos realybės projektai, naudodamas technologijas kaip Nuxt, Android Studio, Unreal Engine 5, Godot Engine ir kt. Taip pat įgijau naudingų teorinių žinių apie objektinį programavimą, dizaino šablonus ir Agile darbo aplinką.",
            "date": "2022 - Dabar"
        },
        "turiba": {
            "title": "3 mėnesių praktika užsienyje",
            "location": "Turiba Universitetas. Ryga, Latvija",
            "description": "Į šia praktika vykau kartu su dviem KVK studentais. Mus paskyrė sukurti LMS – mokymosi valdymo sistemos prototipą nuo nulio. Aš buvau vienintelis atsakingas už back-end dalį, mikroservisų projektavimą ir kūrimą. Kartais padėdavau front-end kūrime.",
            "date": "Gegužė - Liepa 2024"
        }
    },
    "contactForm": {
        "title": "Susisiekite",
        "subtitle": {
            "first": "Susisiekite tiesiogiai per elektroninį paštą",
            "second": "arba užpildykite formą"
        },
        "email": "Elektroninis paštas",
        "name":"Vardas",
        "message": "Žinutė",
        "send": "Siųsti",
        "success": "Žinutė sėkmingai išsiųsta",
        "error": "Įvyko klaida, bandykite dar kartą vėliau",
        "required": {
            "name": "*Vardas yra privalomas",
            "email": "*Elektroninis paštas yra privalomas",
            "emailValid": "*Įveskite teisingą elektroninį paštą",
            "message": "*Žinutė yra privaloma, bent 10 simbolių ilgio",
            "messageLength": "*Žinutė turi būti bent 10 simbolių ilgio"
        }
    },
    "projectModal": {
        "header": {
            "description": "Aprašymas",
            "technologies": "Naudojamos technologijos",
            "links": "Nuorodos"
        },
        "close": "Uždaryti"
    }
}